{
  "_name_or_path": "ner_resume_model",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-College Name",
    "1": "B-Companies worked at",
    "2": "B-Degree",
    "3": "B-Designation",
    "4": "B-Email Address",
    "5": "B-Graduation Year",
    "6": "B-Location",
    "7": "B-Name",
    "8": "B-Skills",
    "9": "I-College Name",
    "10": "I-Companies worked at",
    "11": "I-Degree",
    "12": "I-Designation",
    "13": "I-Email Address",
    "14": "I-Graduation Year",
    "15": "I-Location",
    "16": "I-Name",
    "17": "I-Skills",
    "18": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-College Name": 0,
    "B-Companies worked at": 1,
    "B-Degree": 2,
    "B-Designation": 3,
    "B-Email Address": 4,
    "B-Graduation Year": 5,
    "B-Location": 6,
    "B-Name": 7,
    "B-Skills": 8,
    "I-College Name": 9,
    "I-Companies worked at": 10,
    "I-Degree": 11,
    "I-Designation": 12,
    "I-Email Address": 13,
    "I-Graduation Year": 14,
    "I-Location": 15,
    "I-Name": 16,
    "I-Skills": 17,
    "O": 18
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
